------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\floo0017\Desktop\research\ATUSGenderSequence
> Analysis\do_files\log_files/04_select_sample_2017.09.08.log
  log type:  text
 opened on:   8 Sep 2017, 17:56:08

. use ../data/generated_data_files/person_recodes.dta;

. count;
  27,884

. /*keep only ATUS respondents*/
> keep if lineno==1;
(17,391 observations deleted)

. count;
  10,493

. /* Limit to employed people*/
> drop if employ==2;
(4,119 observations deleted)

. count;
  6,374

. /*Limit to parents*/
> drop if numberhhchild==0;
(3,237 observations deleted)

. count;
  3,137

.  /*Random Sample of 500 Cases from 2016*/
>         /*
>         sort                    tucaseid
>         preserve
>                 tempfile        tmp
>                 bysort          tucaseid: keep if _n == 1
>                 sample          500, count
>                 sort            tucaseid
>                 save            `tmp'
>         restore
>         merge                   m:1 tucaseid using `tmp'
>         keep if                 _merge == 3
>         drop                    _merge
>         */
> 
> 
> mark nomiss;

. markout nomiss  female nevmar umpartner divsep exfamdum numberhh
> child kidu2dum kid2to5 lths highschool somecol parttime black as
> ian hispanic otherrace age weekend;

. tab nomiss;

     nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,137      100.00      100.00
------------+-----------------------------------
      Total |      3,137      100.00

. drop if nomiss==0;
(0 observations deleted)

. drop _merge;

. merge 1:m caseid using ../data/generated_data_files/ATUS_activit
> ies;

    Result                           # of obs.
    -----------------------------------------
    not matched                       140,614
        from master                         0  (_merge==1)
        from using                    140,614  (_merge==2)

    matched                            66,599  (_merge==3)
    -----------------------------------------

. tab year _merge;

    Survey |        _merge
      year | 2. using   3. matche |     Total
-----------+----------------------+----------
      2016 |   140,614     66,599 |   207,213 
-----------+----------------------+----------
     Total |   140,614     66,599 |   207,213 


. keep if _merge==3;
(140,614 observations deleted)

. save ../data/generated_data_files/sequences_0316.dta, replace;
file ../data/generated_data_files/sequences_0316.dta saved

. log close;
      name:  <unnamed>
       log:  C:\Users\floo0017\Desktop\research\ATUSGenderSequence
> Analysis\do_files\log_files/04_select_sample_2017.09.08.log
  log type:  text
 closed on:   8 Sep 2017, 17:56:09
------------------------------------------------------------------
