------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\floo0017\Desktop\research\ATUSGenderSequence
> Analysis\do_files\log_files/04_select_sample_2017.09.08.log
  log type:  text
 opened on:   8 Sep 2017, 17:47:24

. use ../data/generated_data_files/person_recodes.dta;

. count;
  27,884

. /*keep only ATUS respondents*/
> keep if lineno==1;
(17,391 observations deleted)

. count;
  10,493

. /* Limit to employed people*/
> drop if employ==2;
(4,119 observations deleted)

. count;
  6,374

. /*Limit to parents*/
> drop if numberhhchild==0;
(3,237 observations deleted)

. count;
  3,137

.  /*Random Sample of 500 Cases from 2016*/
>         /*
>         sort                    tucaseid
>         preserve
>                 tempfile        tmp
>                 bysort          tucaseid: keep if _n == 1
>                 sample          500, count
>                 sort            tucaseid
>                 save            `tmp'
>         restore
>         merge                   m:1 tucaseid using `tmp'
>         keep if                 _merge == 3
>         drop                    _merge
>         */
> 
> 
> mark nomiss;

. markout nomiss  female nevmar umpartner divsep exfamdum numberhh
> child kidu2dum kid2to5 lths highschool somecol parttime black as
> ian hispanic otherrace age weekend;

. tab nomiss;

     nomiss |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,137      100.00      100.00
------------+-----------------------------------
      Total |      3,137      100.00

. drop if nomiss==0;
(0 observations deleted)

. save ../data/generated_data_files/sequences_0316.dta, replace;
(note: file ../data/generated_data_files/sequences_0316.dta not fo
> und)
file ../data/generated_data_files/sequences_0316.dta saved

. log close;
      name:  <unnamed>
       log:  C:\Users\floo0017\Desktop\research\ATUSGenderSequence
> Analysis\do_files\log_files/04_select_sample_2017.09.08.log
  log type:  text
 closed on:   8 Sep 2017, 17:47:24
------------------------------------------------------------------
